# Реализовать калькулятор суммы 2-х чисел

a = int(input())
b = int(input())
print("Сумма=" + str(a + b))