# Найти подстроку в строке

string = input("Введите строку")
substring = input("Введите подстроку")
if substring in string:
    print("Подстрока найдена")
