# Найти подстроку в строке, если подстрока найдена вывести "Подстрока найдена"

string = input("Введите строку")
substring = input("Введите подстроку")
if substring in string:
    print("Подстрока найдена")
